#+TITLE: Code R Us
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t d:(not "HINT")
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: theme-bigblow.setup

***** Two Tasks
    1. Create the function =create-rns-alist=.
    2. Use the =test-rns= package.
#+BEGIN_SRC elisp :results silent
  (defun rns (n)
    (list (mod n 7) (mod n 11) (mod n 13)))

  (defun create-rns-alist ()
    (loop for n from 0 to 1001
          collect (cons n (rns n))))
#+END_SRC

#+BEGIN_SRC elisp :results code
  (setq rns-alist (create-rns-alist))
#+END_SRC

#+BEGIN_SRC elisp :results silent
  (defun to-rns (n)
    (cdr (assoc n rns-alist)))

  (defun from-rns (rns-triple)
    (car (rassoc rns-triple rns-alist)))
#+END_SRC

#+BEGIN_SRC elisp
  (list (to-rns 999)
        (from-rns '(5 9 11)))
#+END_SRC

#+RESULTS:
| (5 9 11) | 999 |

#+BEGIN_SRC elisp :results raw
  (list (to-rns 12) (to-rns 16))
#+END_SRC

#+RESULTS:
((5 1 12) (2 5 3))

#+BEGIN_SRC elisp :results raw
  (list (mod (* 5 2) 7) (mod (* 1 5) 11) (mod (* 12 3) 13))
#+END_SRC

#+RESULTS:
(3 5 10)
*** DONE CDL
  Write elisp code that takes two same-sized vectors of one-character symbols
  and \ldquo{}shuffles\rdquo them together into one vector. For example:
#+BEGIN_SRC elisp :results silent
  (defun shuffle (vector1 vector2)
    (apply 'vconcat (mapcar* 'vector vector1 vector2)))
#+END_SRC

#+BEGIN_SRC elisp :results raw
  (shuffle [a b c d e f] [1 2 3 4])
#+END_SRC

#+RESULTS:
[a 1 b 2 c 3 d 4]

  It\rsquo{}s EASY with a loop:

#+BEGIN_SRC elisp :results silent
  (defun shuffle (v1 v2)
    (loop for e1 across v1
          for e2 across v2
          vconcat (vector e1 e2)))
#+END_SRC

***** Perfect Shuffling (Scrambling)
#+BEGIN_SRC elisp :results raw
  (setq deck0 [As 2s 3s 4s 5s 6s 7s 8s 9s 10s Js Qs Ks
               Ah 2h 3h 4h 5h 6h 7h 8h 9h 10h Jh Qh Kh
               Ac 2c 3c 4c 5c 6c 7c 8c 9c 10c Jc Qc Kc
               Ad 2d 3d 4d 5d 6d 7d 8d 9d 10d Jd Qd Kd]
        deck1 (shuffle deck0)
        deck2 (shuffle deck1)
        deck3 (shuffle deck2)
        deck4 (shuffle deck3)
        deck5 (shuffle deck4)
        deck6 (shuffle deck5)
        deck7 (shuffle deck6)
        deck8 (shuffle deck7)
        show deck5)
#+END_SRC

#+RESULTS:
[As 9s 4h Qh 7c 2d 10d 6s Ah 9h 4c Qc 7d 3s Js 6h Ac 9c 4d Qd 8s 3h Jh 6c Ad 9d 5s Ks 8h 3c Jc 6d 2s 10s 5h Kh 8c 3d Jd 7s 2h 10h 5c Kc 8d 4s Qs 7h 2c 10c 5d Kd]

#+BEGIN_SRC elisp
  (list (list deck0)
        (list deck8)
        (list (format "(equal deck0 deck8) => %s" (equal deck0 deck8))))
#+END_SRC

#+RESULTS:
| [As 2s 3s 4s 5s 6s 7s 8s 9s 10s Js Qs Ks Ah 2h 3h 4h 5h 6h 7h 8h 9h 10h Jh Qh Kh Ac 2c 3c 4c 5c 6c 7c 8c 9c 10c Jc Qc Kc Ad 2d 3d 4d 5d 6d 7d 8d 9d 10d Jd Qd Kd] |
| [As 2s 3s 4s 5s 6s 7s 8s 9s 10s Js Qs Ks Ah 2h 3h 4h 5h 6h 7h 8h 9h 10h Jh Qh Kh Ac 2c 3c 4c 5c 6c 7c 8c 9c 10c Jc Qc Kc Ad 2d 3d 4d 5d 6d 7d 8d 9d 10d Jd Qd Kd] |
| (equal deck0 deck8) => t                                                                                                                                          |

#+BEGIN_SRC elisp
  (a-better-mod-expt 8 65537 33)  
  (calc-eval "8^65537%33")
#+END_SRC

#+RESULTS:
: 2

